CSI API ETABS v1

# cDStEurocode_3_2005GetPreference Method

---

Retrieves the value of a steel design preference item.

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int GetPreference(
    	int Item,
    	ref double Value
    )

    Function GetPreference (
    	Item As Integer,
    	ByRef Value As Double
    ) As Integer

    Dim instance As cDStEurocode_3_2005
    Dim Item As Integer
    Dim Value As Double
    Dim returnValue As Integer

    returnValue = instance.GetPreference(Item,
    	Value)

    int GetPreference(
    	int Item,
    	double% Value
    )

    abstract GetPreference :
            Item : int *
            Value : float byref -> int

#### Parameters

Item

    Type: SystemInt32
This is an integer between 1 and 24, inclusive, indicating the preference item
considered.

  1. Country
  2. Combos equation
  3. K factor method
  4. Framing type
  5. Partial safety factor, GammaM0
  6. Partial safety factor, GammaM1
  7. Partial safety factor, GammaM2
  8. Consider deflection
  9. DL deflection limit, L/Value
  10. SDL + LL deflection limit, L/Value
  11. LL deflection limit, L/Value
  12. Total load deflection limit, L/Value
  13. Total camber limit, L/Value
  14. Pattern live load factor
  15. Demand/capacity ratio limit
  16. Multi-response case design
  17. Reliability class
  18. Behavior factor, q
  19. System overstrength, Omega
  20. Consider P-delta
  21. Consider torsion
  22. Ignore seismic code
  23. Ignore special seismic load
  24. Are Doubler plates plug-welded

Value

    Type: SystemDouble
The numeric value of the considered preference item.

  1. Country
     * 1 = CEN Default
     * 2 = United Kingdom
     * 3 = Slovenia
     * 4 = Bulgaria
     * 5 = Norway
     * 6 = Singapore
     * 7 = Sweden
     * 8 = Finland
     * 9 = Denmark
     * 10 = Portugal
     * 11 = Germany
     * 12 = Poland
     * 13 = Ireland
  2. Combos equation
     * 1 = Eq. 6.10
     * 2 = Max of Eqs. 6.10a and 6.10b
  3. K factor method
     * 1 = Method A
     * 2 = Method B
     * 3 = Both
  4. Framing type
     * 1 = DCH-MRF (Ductility Class High - Moment Frame)
     * 2 = DCM-MRF (Ductility Class Medium - Moment Frame)
     * 3 = DCL-MRF (Ductility Class Low - Moment Frame)
     * 4 = DCH-CBF (Ductility Class High - Concentrically Braced Frame)
     * 5 = DCM-CBF (Ductility Class Medium - Concentrically Braced Frame)
     * 6 = DCL-CBF (Ductility Class Low - Concentrically Braced Frame)
     * 7 = DCH-EBF (Ductility Class High - Eccentrically Braced Frame)
     * 8 = DCM-EBF (Ductility Class Medium - Eccentrically Braced Frame)
     * 9 = DCL-EBF (Ductility Class Low - Eccentrically Braced Frame)
     * 10 = Inverted Pendulum Structure
     * 11 = Secondary
     * 12 = Non Seismic
  5. Partial safety factor, GammaM0

Value > 0

  6. Partial safety factor, GammaM1

Value > 0

  7. Partial safety factor, GammaM2

Value > 0

  8. Consider deflection

0 = No

Any other value = Yes

  9. DL deflection limit, L/Value

Value > 0

  10. SDL + LL deflection limit, L/Value

Value > 0

  11. LL deflection limit, L/Value

Value > 0

  12. Total load deflection limit, L/Value

Value > 0

  13. Total camber limit limit, L/Value

Value > 0

  14. Pattern live load factor

Value > 0

  15. Demand/capacity ratio limit

Value > 0

  16. Multi-response case design
     * 1 = Envelopes
     * 2 = Step-by-Step
     * 3 = Last Step
     * 4 = Enveleopes -- All
     * 5 = Step-by-Step -- All
  17. Reliability class
     * 1 = Class 1
     * 2 = Class 2
     * 3 = Class 3
  18. Behavior factor, q

Value > 0

  19. System overstrength, Omega

Value > 0

  20. Consider P-delta

0 = No

Any other value = Yes

  21. Consider Torsion

0 = No

Any other value = Yes

  22. Ignore seismic code

0 = No

Any other value = Yes

  23. Ignore special seismic load

0 = No

Any other value = Yes

  24. Are Doubler plates plug-welded

0 = No

Any other value = Yes

#### Return Value

Type: Int32
Returns zero if the item is successfully retrieved; otherwise it returns a
nonzero value.

Remarks

Examples

VB

Copy

    Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim Value As Double
       Dim ProgDet As Boolean

    'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")

    'start ETABS application
      ret = EtabsObject.ApplicationStart()

    'create SapModel object
       SapModel = EtabsObject.SapModel

    'initialize model
       ret = SapModel.InitializeNewModel()

    'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)

    'set steel design code
       ret = SapModel.DesignSteel.SetCode("Eurocode 3-2005")

    'set overwrite item
       ret = SapModel.DesignSteel.Eurocode_3_2005.GetPreference(2, Value)

    'close ETABS
       EtabsObject.ApplicationExit(False)

    'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing

    End Sub

See Also

#### Reference

cDStEurocode_3_2005 Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com